Revit 2024 API
View.HideCategoryTemporary Method
 Set one category to be temporarily hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void HideCategoryTemporary(
	ElementId elementId
)
Visual Basic
Public Sub HideCategoryTemporary ( _
	elementId As ElementId _
)
Visual C++
public:
void HideCategoryTemporary(
	ElementId^ elementId
)
Parameters
elementId
Type: Autodesk.Revit.DB.ElementId
 Id of the category to be hidden
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  elementId does not correspond to a Category.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
View Class
Autodesk.Revit.DB Namespace